OLD/results/results_1/aggregated/out 512/test4-4img-rate0.5-total150-seed-76531/output.txt
[Thu Jul 23 06:29:28 AM UTC 2026] Waiting for http://aggregation-epp:80/v1/models ...
  Endpoint up.

[Thu Jul 23 06:29:28 AM UTC 2026] === Rate 0.5 ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
/sgl-workspace/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1920x1080) with 600 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=150, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=512, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.5, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=76531, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://aggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=150, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=512, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.5, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=76531, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 1246641
#Output tokens: 76800
#Total images: 600
#Images per request: 4 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=19200
  Text prompt tokens (with chat template): avg=142.9, total=21441
  Text prompt overhead: avg=14.9, total=2241
  Vision tokens: avg=8168.0, total=1225200

Created 150 random jpeg images with average 8359389 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/150 [00:00<?, ?it/s]
  1%|          | 1/150 [00:07<19:32,  7.87s/it]
  1%|▏         | 2/150 [00:11<13:08,  5.33s/it]
  2%|▏         | 3/150 [00:17<13:51,  5.66s/it]
  3%|▎         | 4/150 [00:28<19:19,  7.94s/it]
  4%|▍         | 6/150 [00:29<09:02,  3.77s/it]
  5%|▌         | 8/150 [00:29<05:16,  2.23s/it]
  7%|▋         | 11/150 [00:30<02:58,  1.28s/it]
  8%|▊         | 12/150 [00:31<02:49,  1.23s/it]
  9%|▊         | 13/150 [00:31<02:25,  1.07s/it]
  9%|▉         | 14/150 [00:31<01:59,  1.14it/s]
 10%|█         | 15/150 [00:33<02:36,  1.16s/it]
 11%|█         | 16/150 [00:34<02:19,  1.04s/it]
 11%|█▏        | 17/150 [00:39<04:45,  2.15s/it]
 12%|█▏        | 18/150 [00:43<05:58,  2.71s/it]
 13%|█▎        | 20/150 [00:47<05:00,  2.31s/it]
 14%|█▍        | 21/150 [00:50<05:12,  2.43s/it]
 15%|█▍        | 22/150 [00:56<06:58,  3.27s/it]
 16%|█▌        | 24/150 [01:00<05:56,  2.83s/it]
 17%|█▋        | 25/150 [01:00<04:38,  2.23s/it]
 17%|█▋        | 26/150 [01:03<04:45,  2.30s/it]
 18%|█▊        | 27/150 [01:03<03:47,  1.85s/it]
 19%|█▊        | 28/150 [01:06<04:01,  1.98s/it]
 19%|█▉        | 29/150 [01:07<03:50,  1.90s/it]
 20%|██        | 30/150 [01:08<03:06,  1.55s/it]
 21%|██        | 31/150 [01:10<03:05,  1.56s/it]
 21%|██▏       | 32/150 [01:13<03:53,  1.98s/it]
 22%|██▏       | 33/150 [01:28<11:19,  5.81s/it]
 23%|██▎       | 35/150 [01:32<08:07,  4.24s/it]
 26%|██▌       | 39/150 [01:33<03:34,  1.93s/it]
 27%|██▋       | 40/150 [01:33<03:02,  1.65s/it]
 27%|██▋       | 41/150 [01:34<02:43,  1.50s/it]
 28%|██▊       | 42/150 [01:36<02:41,  1.49s/it]
 29%|██▊       | 43/150 [01:36<02:05,  1.17s/it]
 29%|██▉       | 44/150 [01:38<02:37,  1.48s/it]
 30%|███       | 45/150 [01:38<02:01,  1.16s/it]
 31%|███       | 46/150 [01:47<05:22,  3.10s/it]
 32%|███▏      | 48/150 [01:49<03:43,  2.19s/it]
 33%|███▎      | 49/150 [01:49<03:07,  1.86s/it]
 33%|███▎      | 50/150 [01:52<03:12,  1.92s/it]
 35%|███▍      | 52/150 [02:08<07:28,  4.57s/it]
 35%|███▌      | 53/150 [02:12<06:59,  4.33s/it]
 37%|███▋      | 55/150 [02:12<04:24,  2.79s/it]
 39%|███▊      | 58/150 [02:17<03:28,  2.26s/it]
 41%|████▏     | 62/150 [02:19<02:04,  1.42s/it]
 43%|████▎     | 64/150 [02:20<01:43,  1.20s/it]
 43%|████▎     | 65/150 [02:23<02:06,  1.49s/it]
 44%|████▍     | 66/150 [02:28<02:50,  2.03s/it]
 45%|████▌     | 68/150 [02:28<01:53,  1.39s/it]
 46%|████▌     | 69/150 [02:29<01:37,  1.20s/it]
 47%|████▋     | 71/150 [02:30<01:26,  1.09s/it]
 48%|████▊     | 72/150 [02:31<01:12,  1.08it/s]
 49%|████▊     | 73/150 [02:32<01:21,  1.05s/it]
 49%|████▉     | 74/150 [02:41<03:51,  3.05s/it]
 50%|█████     | 75/150 [02:50<05:43,  4.58s/it]
 53%|█████▎    | 79/150 [02:51<02:12,  1.87s/it]
 54%|█████▍    | 81/150 [02:51<01:31,  1.33s/it]
 55%|█████▌    | 83/150 [02:56<01:58,  1.77s/it]
 56%|█████▌    | 84/150 [02:57<01:40,  1.53s/it]
 58%|█████▊    | 87/150 [02:57<00:55,  1.13it/s]
 59%|█████▉    | 89/150 [03:09<02:24,  2.38s/it]
 60%|██████    | 90/150 [03:09<02:00,  2.01s/it]
 61%|██████▏   | 92/150 [03:14<02:03,  2.12s/it]
 63%|██████▎   | 94/150 [03:15<01:35,  1.70s/it]
 63%|██████▎   | 95/150 [03:16<01:19,  1.44s/it]
 64%|██████▍   | 96/150 [03:16<01:06,  1.24s/it]
 65%|██████▌   | 98/150 [03:16<00:41,  1.26it/s]
 68%|██████▊   | 102/150 [03:30<01:45,  2.20s/it]
 69%|██████▊   | 103/150 [03:33<01:48,  2.31s/it]
 69%|██████▉   | 104/150 [03:34<01:34,  2.05s/it]
 71%|███████▏  | 107/150 [03:36<01:04,  1.50s/it]
 73%|███████▎  | 109/150 [03:38<00:50,  1.22s/it]
 75%|███████▍  | 112/150 [03:50<01:30,  2.38s/it]
 77%|███████▋  | 115/150 [03:51<00:56,  1.61s/it]
 77%|███████▋  | 116/150 [03:53<00:56,  1.67s/it]
 78%|███████▊  | 117/150 [03:55<00:56,  1.71s/it]
 79%|███████▊  | 118/150 [03:55<00:46,  1.46s/it]
 81%|████████▏ | 122/150 [03:57<00:26,  1.06it/s]
 82%|████████▏ | 123/150 [04:01<00:39,  1.45s/it]
 83%|████████▎ | 124/150 [04:02<00:36,  1.41s/it]
 84%|████████▍ | 126/150 [04:03<00:24,  1.02s/it]
 85%|████████▌ | 128/150 [04:07<00:30,  1.41s/it]
 86%|████████▌ | 129/150 [04:15<00:55,  2.64s/it]
 87%|████████▋ | 130/150 [04:20<01:02,  3.13s/it]
 88%|████████▊ | 132/150 [04:22<00:40,  2.23s/it]
 89%|████████▊ | 133/150 [04:26<00:43,  2.57s/it]
 89%|████████▉ | 134/150 [04:26<00:32,  2.04s/it]
 90%|█████████ | 135/150 [04:27<00:28,  1.91s/it]
 91%|█████████ | 136/150 [04:28<00:23,  1.67s/it]
 91%|█████████▏| 137/150 [04:29<00:16,  1.29s/it]
 92%|█████████▏| 138/150 [04:33<00:26,  2.20s/it]
 93%|█████████▎| 139/150 [04:34<00:19,  1.75s/it]
 93%|█████████▎| 140/150 [04:34<00:14,  1.42s/it]
 94%|█████████▍| 141/150 [04:35<00:10,  1.14s/it]
 95%|█████████▍| 142/150 [04:36<00:09,  1.17s/it]
 95%|█████████▌| 143/150 [04:38<00:09,  1.42s/it]
 97%|█████████▋| 145/150 [04:50<00:16,  3.40s/it]
 97%|█████████▋| 146/150 [04:50<00:11,  2.76s/it]
 99%|█████████▉| 149/150 [04:51<00:01,  1.39s/it]
100%|██████████| 150/150 [04:51<00:00,  1.94s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    0.5       
Max request concurrency:                 not set   
Successful requests:                     150       
Benchmark duration (s):                  291.22    
Total input tokens:                      1246641   
Total input text tokens:                 21441     
Total input vision tokens:               1225200   
Total generated tokens:                  76800     
Total generated tokens (retokenized):    45199     
Request throughput (req/s):              0.52      
Input token throughput (tok/s):          4280.70   
Output token throughput (tok/s):         263.71    
Peak output token throughput (tok/s):    583.00    
Peak concurrent requests:                14        
Total token throughput (tok/s):          4544.41   
Concurrency:                             6.72      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   13043.09  
Median E2E Latency (ms):                 13218.46  
P90 E2E Latency (ms):                    16363.35  
P95 E2E Latency (ms):                    16683.68  
P99 E2E Latency (ms):                    17610.37  
---------------Time to First Token----------------
Mean TTFT (ms):                          1481.36   
Median TTFT (ms):                        1389.73   
P90 TTFT (ms):                           1874.38   
P95 TTFT (ms):                           1969.18   
P99 TTFT (ms):                           2195.23   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.63     
Median TPOT (ms):                        22.96     
P90 TPOT (ms):                           28.94     
P95 TPOT (ms):                           29.81     
P99 TPOT (ms):                           31.41     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           29.64     
Median ITL (ms):                         17.14     
P90 ITL (ms):                            35.49     
P95 ITL (ms):                            48.37     
P99 ITL (ms):                            559.47    
Max ITL (ms):                            1229.45   
==================================================
[Thu Jul 23 06:36:05 AM UTC 2026] Rate 0.5 done.
[Thu Jul 23 06:36:05 AM UTC 2026] All rates complete.